base/Enums/бит_ЕдиницыИзмеренияСумм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ЕдиницыИзмеренияСумм</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тысячи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Миллионы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Documents/бит_кзн_ЗаявкаНаРасходованиеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗаявкаНаРасходованиеСредств</Name>
			<Comment>(БИТ)</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийКазначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_ДополнительныеУсловияПоДоговору</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_пз_ЗаявкаНаЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_пз_СводнаяЗаявкаНаЗатраты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика2_5</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленНаСогласование</Name>
					<Comment>Признак того, что работа с документом завершена и он отправлен на согласование. Используется только в режиме "Проводить документы после утверждения".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежиПо275ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСЗаказчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктКонтрактаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежаФЗ275</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПлатежейФЗ275</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСУчастникомГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПланированияОплатыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбъединятьПозицииПриОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодтверждающиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПодтверждающихДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентовПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКредитовИДепозитовПрисоединенныеФайлы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациямиПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

base/CommonModules/бит_КазначействоКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область КомандыВводаНаОсновании

// Обработчик подключенной команды.
//
// Параметры:
//   ПараметрКоманды - Массив Из ЛюбаяСсылка - ссылки выбранных объектов, для которых выполняется команда.
//   ПараметрыВыполнения - см. ПодключаемыеКомандыКлиент.ПараметрыВыполненияКоманды
//
Процедура СоздатьЗаявкуНаРасходованиеСредств(ПараметрКоманды, ПараметрыВыполнения) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);

	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Основание = ПараметрКоманды;
	Иначе
		Основание = ПараметрКоманды[0];
	КонецЕсли;
	
	ТипыСОсобойОбработкойЗаполнения = Новый Массив; 
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.ПриобретениеТоваровУслуг"));
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов"));
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента"));
	
	// ++ Локализация
	Если НЕ бит_ОбщегоНазначенияВызовСервера.ЭтоУТ() Тогда
		ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.ЗаказПереработчику2_5"));
		ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.ЗаказПереработчику"));
	КонецЕсли;
	Если бит_ОбщегоНазначенияКлиентСерверПереопределяемый.ЕстьДоговорыАренды() Тогда
		ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("СправочникСсылка.ДоговорыАренды"));
	КонецЕсли;
	// -- Локализация
	
	Если ТипыСОсобойОбработкойЗаполнения.Найти(ТипЗнч(Основание)) <> Неопределено Тогда
		МодульСтрокой		   = "Документ.бит_кзн_ЗаявкаНаРасходованиеСредств";
		ПараметрыОткрытияФормы = бит_КазначействоВызовСервера.ПараметрыФормыВводНаОсновании(МодульСтрокой, Основание);
		
		ОткрытьФорму(ПараметрыОткрытияФормы.ИмяФормы, ПараметрыОткрытияФормы.ПараметрыФормы,
				ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
		ПараметрыФормы = Новый Структура("Основание", Основание);
		ОткрытьФорму("Документ.бит_кзн_ПлатежнаяПозиция.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик подключенной команды.
//
// Параметры:
//   ПараметрКоманды - Массив Из ЛюбаяСсылка - ссылки выбранных объектов, для которых выполняется команда.
//   ПараметрыВыполнения - см. ПодключаемыеКомандыКлиент.ПараметрыВыполненияКоманды
//
Процедура СоздатьПланируемоеПоступлениеСредств(ПараметрКоманды, ПараметрыВыполнения) Экспорт
	
	ПараметрыВыполненияКоманды = Новый Структура("Источник,Уникальность,Окно,НавигационнаяСсылка");
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияКоманды, ПараметрыВыполнения.ОписаниеКоманды.ДополнительныеПараметры);

	Если НЕ ПараметрыВыполнения.ОписаниеКоманды.МножественныйВыбор Тогда
		Основание = ПараметрКоманды;
	Иначе
		Основание = ПараметрКоманды[0];
	КонецЕсли;
	
	ТипыСОсобойОбработкойЗаполнения = Новый Массив; 
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.СчетНаОплатуКлиенту"));
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.РеализацияУслугПрочихАктивов"));
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	ТипыСОсобойОбработкойЗаполнения.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));

	Если ТипыСОсобойОбработкойЗаполнения.Найти(ТипЗнч(Основание)) <> Неопределено Тогда
		МодульСтрокой		   = "Документ.бит_кзн_ПланируемоеПоступлениеДенежныхСредств";
		ПараметрыОткрытияФормы = бит_КазначействоВызовСервера.ПараметрыФормыВводНаОсновании(МодульСтрокой, Основание);
		
		ОткрытьФорму(ПараметрыОткрытияФормы.ИмяФормы, ПараметрыОткрытияФормы.ПараметрыФормы,
				ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
		ПараметрыФормы = Новый Структура("Основание", Основание);
		ОткрытьФорму("Документ.бит_кзн_ПозицияПоступления.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
			ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Возвращает параметры подбора расчетных документов.
//
// Возвращаемое значение:
//	ПараметрыВыбора - Структура:
//		Организация - СправочникСсылка.Организации - Организация документа
//		Контрагент - СправочникСсылка.Контрагенты - Контрагент документа
//		ЭтоРасчетыСКлиентами - Булево - Признак расчетов с клиентами
//		Элемент - ПолеФормы - Поле для выбора документа расчетов
//		Партнер - СправочникСсылка.Партнеры - Партнер документа
//		Соглашение - Соглашение с клиентом или соглашение с поставщиком
//		ВыборОснованияПлатежа - Булево
//		ИсключитьХозяйственнуюОперацию - Булево
//		ПлатежиПо275ФЗ - Булево
//		ДоговорСУчастникомГОЗ - Булево
//		Валюта - СправочникСсылка.Валюты - Валюта документа
//		Сумма - Число - Сумма документа
//
Функция НовыеПараметрыВыбораРасчетныхДокументов() Экспорт
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Организация");
	ПараметрыВыбора.Вставить("Контрагент");
	ПараметрыВыбора.Вставить("ЭтоРасчетыСКлиентами");
	ПараметрыВыбора.Вставить("Элемент");
	ПараметрыВыбора.Вставить("Партнер",                        Неопределено);
	ПараметрыВыбора.Вставить("Соглашение",                     Неопределено);
	ПараметрыВыбора.Вставить("ВыборОснованияПлатежа",          Ложь);
	ПараметрыВыбора.Вставить("ИсключитьХозяйственнуюОперацию", Ложь);
	ПараметрыВыбора.Вставить("ПлатежиПо275ФЗ",                 Ложь);
	ПараметрыВыбора.Вставить("ДоговорСУчастникомГОЗ",          Ложь);
	ПараметрыВыбора.Вставить("Валюта",                         Неопределено);
	ПараметрыВыбора.Вставить("Сумма",                          0);
	
	Возврат ПараметрыВыбора;
	
КонецФункции

// Процедура вызывается из модуля формы документов при обработке оповещения
//
// Параметры:
//   Форма - Управляемая форма, для которой производится обработка оповещения
//   ДокументСсылка - ссылка на документ формы
//   ИмяСобытия - имя обрабатываемого события
//   Параметр - параметр, переданный в обработку оповещения
//   Источник - источник, переданный в обработку оповещения
Процедура ОбработкаОповещенияФормыДокумента(Форма, ДокументСсылка, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ВыполненаЗаписьДокумента" Тогда
		Если ДокументСсылка = Параметр.ДокументСсылка Тогда 
			Форма.Прочитать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Функция НовыеПараметрыДокументаДляПолученияДанныхБюджета() Экспорт

	ПараметрыДокумента = Новый Структура;
	
	ПараметрыДокумента.Вставить("ВалютаДокумента", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
	ПараметрыДокумента.Вставить("Дата",            '00010101');
	ПараметрыДокумента.Вставить("ЕдиницаИзмеренияСумм",
									ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Единицы"));
	ПараметрыДокумента.Вставить("ЕдиницаИзмеренияСуммДокумента",
									ПредопределенноеЗначение("Перечисление.бит_ЕдиницыИзмеренияСумм.Единицы"));
	ПараметрыДокумента.Вставить("КратностьДокумента", 1);
	ПараметрыДокумента.Вставить("КурсДокумента",      1);
	ПараметрыДокумента.Вставить("Параметр",
									ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыПроизвольныхПараметров.ПустаяСсылка"));
	ПараметрыДокумента.Вставить("Сценарий", ПредопределенноеЗначение("Справочник.СценарииПланирования.ПустаяСсылка"));
	
	Возврат ПараметрыДокумента;
	
КонецФункции

#КонецОбласти
